<template>
  <div class="ffaq"><!--   @mousemove="cursorShadow($event)"-->

    <div class="w-100 " style="top: 0; right: 0;">
      <h1 class="w-100 mb-5 text-center">سـوالات مـتـداول</h1>
      <div class="w-100 mt-5 faqq">
        <div class="faq-inner d-flex" :style="{Width: width+'%'}">
          <div v-for="(item,index) in faq" :key="index" class="faq" @mouseover="scroll($event)"
               @mouseleave="scrollBack($event)"> <!---->
            <div class="faq-box bg-white me-4"
                 :class="{'mt-5':index%2===1, 'ms-4':index===0, 'me-0':index===faq.length-1}">
              <h1>{{ item.title }}</h1>
              <p>{{ item.summary }}</p>
            </div>
          </div>
        </div>

      </div>
    </div>
  </div>

</template>
<script>
export default {
  setup(){
    const faq = [
      {
        id: 1,
        title: 'خوراک زنبور کوپابی چه تفاوتی با سایر محصولات بازار دارد؟',
        summary: 'کوپابی با بافت نیمه‌جامد، مصرف آسان‌تر، ماندگاری بالا و فرمولاسیون علمی، تجربه‌ای متفاوت از تغذیه زنبور عسل فراهم می‌کند.'
      },
      {
        id: 2,
        title: 'خمیر شیرین چیست و چه کاربردی دارد؟',
        summary: 'خمیر شیرین یک خوراک مکمل برای زنبور عسل است که در زمان کمبود منابع طبیعی، به حفظ سلامت و پایداری کلنی کمک می‌کند.'
      },
      {
        id: 3,
        title: 'بهترین زمان استفاده از کوپابی چه زمانی است؟',
        summary: 'این محصول برای فصل کمبود شهد، پاییز، زمستان و اوایل بهار طراحی شده است.'
      },
      {
        id: 4,
        title: 'آیا برای استفاده از کوپابی نیاز به افزودن آب وجود دارد؟',
        summary: 'خیر. کوپابی کاملاً آماده مصرف است و بدون نیاز به رقیق‌سازی در اختیار زنبورها قرار می‌گیرد.'
      },
      {
        id: 1,
        title: 'خوراک زنبور کوپابی چه تفاوتی با سایر محصولات بازار دارد؟',
        summary: 'کوپابی با بافت نیمه‌جامد، مصرف آسان‌تر، ماندگاری بالا و فرمولاسیون علمی، تجربه‌ای متفاوت از تغذیه زنبور عسل فراهم می‌کند.'
      },
      {
        id: 2,
        title: 'خمیر شیرین چیست و چه کاربردی دارد؟',
        summary: 'خمیر شیرین یک خوراک مکمل برای زنبور عسل است که در زمان کمبود منابع طبیعی، به حفظ سلامت و پایداری کلنی کمک می‌کند.'
      },
      {
        id: 3,
        title: 'بهترین زمان استفاده از کوپابی چه زمانی است؟',
        summary: 'این محصول برای فصل کمبود شهد، پاییز، زمستان و اوایل بهار طراحی شده است.'
      },
      {
        id: 4,
        title: 'آیا برای استفاده از کوپابی نیاز به افزودن آب وجود دارد؟',
        summary: 'خیر. کوپابی کاملاً آماده مصرف است و بدون نیاز به رقیق‌سازی در اختیار زنبورها قرار می‌گیرد.'
      },
      {
        id: 1,
        title: 'خوراک زنبور کوپابی چه تفاوتی با سایر محصولات بازار دارد؟',
        summary: 'کوپابی با بافت نیمه‌جامد، مصرف آسان‌تر، ماندگاری بالا و فرمولاسیون علمی، تجربه‌ای متفاوت از تغذیه زنبور عسل فراهم می‌کند.'
      },
      {
        id: 2,
        title: 'خمیر شیرین چیست و چه کاربردی دارد؟',
        summary: 'خمیر شیرین یک خوراک مکمل برای زنبور عسل است که در زمان کمبود منابع طبیعی، به حفظ سلامت و پایداری کلنی کمک می‌کند.'
      },
      {
        id: 3,
        title: 'بهترین زمان استفاده از کوپابی چه زمانی است؟',
        summary: 'این محصول برای فصل کمبود شهد، پاییز، زمستان و اوایل بهار طراحی شده است.'
      },
      {
        id: 4,
        title: 'آیا برای استفاده از کوپابی نیاز به افزودن آب وجود دارد؟',
        summary: 'خیر. کوپابی کاملاً آماده مصرف است و بدون نیاز به رقیق‌سازی در اختیار زنبورها قرار می‌گیرد.'
      },
      {
        id: 1,
        title: 'خوراک زنبور کوپابی چه تفاوتی با سایر محصولات بازار دارد؟',
        summary: 'کوپابی با بافت نیمه‌جامد، مصرف آسان‌تر، ماندگاری بالا و فرمولاسیون علمی، تجربه‌ای متفاوت از تغذیه زنبور عسل فراهم می‌کند.'
      },
      {
        id: 2,
        title: 'خمیر شیرین چیست و چه کاربردی دارد؟',
        summary: 'خمیر شیرین یک خوراک مکمل برای زنبور عسل است که در زمان کمبود منابع طبیعی، به حفظ سلامت و پایداری کلنی کمک می‌کند.'
      },
      {
        id: 3,
        title: 'بهترین زمان استفاده از کوپابی چه زمانی است؟',
        summary: 'این محصول برای فصل کمبود شهد، پاییز، زمستان و اوایل بهار طراحی شده است.'
      },
      {
        id: 4,
        title: 'آیا برای استفاده از کوپابی نیاز به افزودن آب وجود دارد؟',
        summary: 'خیر. کوپابی کاملاً آماده مصرف است و بدون نیاز به رقیق‌سازی در اختیار زنبورها قرار می‌گیرد.'
      },
    ];
    const width = (faq.length * 300 / 100) + 100;
    const scroll = (e) => {
      document.querySelector('.faqq').scrollLeft = -e.clientX;

    }
    const scrollBack = (e) => {
      document.querySelector('.faqq').scrollLeft = e.clientX;

    }
    return{
      faq, width,scroll,scrollBack
    }
  }
}
</script>

<style scoped>

</style>